
{"paragraph": "Personalized recommendation systems are becoming increasingly ubiquitous in our daily lives. This technology is mostly popular on websites related to e-commerce, the news, social media, and entertainment. Due to its popularity, many recent studies have investigated personalized recommendation in the aforementioned domains. Within the scientific field, a personalized paper recommendation system is just as important as in other domains. This is particularly true for new (typically young or novice) researchers who have just started their careers and are not yet familiar with their own field of interest. This type of researcher may have difficulty navigating digital libraries to find the relevant literature. The current rapid growth of knowledge and technology has led to thousands of scientific papers being published on a daily basis, so personalized paper recommendation is essential for novice and even experienced researchers, mainly to save time by presenting them with only the most relevant literature for their needs. Existing studies have typically viewed the paper recommendation task in the context of reading activity. Specifically, they process information from a target user’s past publications (typically paper abstracts), and then recommend other papers to read. These studies assumed that user interest is rather static, and paper recommendation is tailored to suit a certain user profile. In contrast, we view the paper recommendation task from the writing activity perspective. Researchers are typically interested in and focus on different types of information during the course of their paper writing activity. For example, in the course of writing the current paper, we start by introducing more general topics related to existing recommendation technologies, and then in the following Related Works section, we narrow it down to more specific topics that are only relevant to our task. This fluid, dynamic behavior continues to occur over the course of writing the remainder of the paper. With the above idea in mind, we propose a novel task of section-based scientific paper recommendation for assisting authors during the paper writing activity. Our approach has the potential to provide more dynamic and fine-grained scientific paper suggestions, depending on the author’s interests across narrow contexts in their ongoing writing activity. Such systems may suggest important and necessary literature that has not been cited yet by the author. For example, imagine that an author is currently writing a paper section (or conducting research) and is interested in a specific method proposed in a paper that was cited in the previous paragraph. Our section-based scientific paper recommender system would have the capability to recommend at least one similar publication that is relevant to. Such assistance from the recommender system can help authors enhance both their productivity in that narrow context and general knowledge at the same time. Our notion of the section-based recommender does not suggest we completely disregard information from previous publications or citing activities. Instead, we further equip such static information (from past publication information) with dynamic information through dynamic sequences of narrow citation activities per paper section. The main contributions of this paper are three-fold: 1. We propose a new scientific paper recommendation task that considers the dynamic citation needs for authors in their writing activity. To this end, we developed a section-based sequential scientific paper recommendation system that considers the most recent citation activities during writing, instead of citation activities that occurred a long time ago in the authors’ past publications. We utilize sequential recommendation techniques and author-citation graphs to avoid the cold-start problem for new authors without known citation activities. In this context, the sequential recommendation techniques are known to work well with little to no data. Also, the system can leverage the knowledge graphs that are constructed using past information. 2. We propose a two-stage “Section-based Sequential Scientific Paper Recommendation” (S3PaR) pipeline for our new task. The pipeline first predicts a cluster of literature, indicating a small pool of papers that might be relevant (i.e., funneling). The second stage retrieves the most relevant papers from this small pool. There are two unique elements in our pipeline. First, we experiment with multi-graph inputs for cluster-prediction, leveraging diverse types of metadata. Second, we leverage both dynamic and static information in the pipeline. 3. We evaluate the performance of the proposed pipeline utilizing data from the computer science domain. Specifically, we perform design analyses on the pipeline and also compare its performance to several baseline methods including, but not limited to, a random retrieval baseline, a similarity-based retrieval method, and BERT4Rec. Due to the nature of our data, which contains no information regarding relevancy (i.e., no user click information, and we only rely on the ordered list of citations that appear in each section of the papers in the dataset), we ultimately rely on a similarity scoring method to evaluate the relevance of the system outputs, given an author and writing activity context. Due to the novelty of the task, there is no existing end-to-end baseline that we can directly compare. Therefore, we rely on module-level experiments. Our experiments show that the section-based scientific paper recommender task and system perform better than the end-to-end baselines with an average performance increase of 17.5 points and 14.4 points compared to the highest-performing baseline (vanilla content-based filtering) for Precision@K and nDCG@K scores, respectively. Section 2 of this paper introduces our related work, and Section 3 describes our problem statement and proposed pipeline. We introduce the baselines and design analyses and discuss the experimental results in Section 4. Finally, we conclude in Section 5 with a brief summary and mention of future work.", "name": "manami", "number": "1"}
{"paragraph": "", "name": "manami", "number": "2"}
{"paragraph": "", "name": "akari", "number": "1"}
{"paragraph": "", "name": "akari", "number": "2"}
{"paragraph": "", "name": "", "number": ""}
{"paragraph": "", "name": "", "number": ""}
{"paragraph": "", "name": "", "number": ""}
{"paragraph": "", "name": "", "number": ""}
{"paragraph": "", "name": "", "number": ""}     